linux_sysbench_io.txt
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.15 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      13160.89
    writes/s:                     8773.92
    fsyncs/s:                     28076.96

Throughput:
    read, MiB/s:                  205.64
    written, MiB/s:               137.09

General statistics:
    total time:                          300.0005s
    total number of events:              15003535

Latency (ms):
         min:                                    0.00
         avg:                                    0.02
         max:                                    2.19
         95th percentile:                        0.10
         sum:                               283152.88

Threads fairness:
    events (avg/stddev):           15003535.0000/0.00
    execution time (avg/stddev):   283.1529/0.00